DataProcessors/ОбработкаЗагрузитьИнформациюОСостояниеДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаЗагрузитьИнформациюОСостояниеДел</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ОтделыОСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ОтделыОСП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеОСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТерритории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонОбслуживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Должники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СостояниеДелБанкДолжник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>СостояниеДелБанкДолжник</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗапроса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоДела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсполнительногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Суд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Суды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка_суд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОДолжник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозбужденияИП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОСП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыОСП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГиперссылкаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаЗагрузитьИнформациюОСостояниеДел/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)

	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);

  ОбработатьНаСервере(ДвоичныеДанные, Файл.Расширение);	 
	
	
	
КонецПроцедуры




&НаСервере
Процедура ОбработатьНаСервере(ДвоичныеДанные, Расширение)

	
	  ТЗОбработа.Очистить();
	
	   ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);
	
	  
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	   
	    Для каждого стр Из ТаблицаЗначений Цикл

			ссылкаДолжник=Неопределено;
			
			ссылкаДоговор=Неопределено;
			
			номерДоговора=Неопределено;
			
			датаЗапроса=Неопределено;
			
			датаРождения=Неопределено;
			
			НомерСудебногоДела=Неопределено;
			
			НомерИсполнительногоДокумента=Неопределено;
			
			Суд=Неопределено;
			
			судАдрес=Неопределено;
			
			ГиперссылкаСуд=Неопределено;
			
			СтатусИП=Неопределено;
			
			ДатаВозбужденияИП=Неопределено;
			
			НомерИП=Неопределено;
			
			ДатаОкончанияИП=Неопределено;
			
			НаименованиеОСП=Неопределено;
			
			НаименованиеОСПСсылка=Неопределено;
			
			НаименованиеОСП=Неопределено;
			
			АдресОСП="";
			
			ГиперссылкаФССП=Неопределено;
			
			
			
			Если ТаблицаЗначений.Колонки.Найти("ФИОКлиента") <> Неопределено И ТаблицаЗначений.Колонки.Найти("ДатаРождения") <> Неопределено  Тогда
				
				ссылкаДолжник=НайтиДолжника(стр.ФИОКлиента,стр.ДатаРождения);
				
			
			КонецЕсли;

			
			
			//стр.НомерДоговора      Номер договора
			
			Если ТаблицаЗначений.Колонки.Найти("НомерДоговора") <> Неопределено Тогда
				
				 Если ссылкаДолжник<> Неопределено  Тогда
				 
					 данныеДоговор= НайтиДоговор(стр.НомерДоговора,ссылкаДолжник);
					 
					  
					  Если данныеДоговор.ссылкаДоговор<>Неопределено Тогда
					  
					  	  ссылкаДоговор=данныеДоговор.ссылкаДоговор;
						  номерДоговора= данныеДоговор.НомерДоговора;
					  
					  Иначе
					       номерДоговора="";
					  	
					  
					  КонецЕсли;
					 
				 
				 КонецЕсли;
			
			КонецЕсли;
			
			
			Если ТаблицаЗначений.Колонки.Найти("ДатаЗапроса") <> Неопределено Тогда
				
				датаЗапроса=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаЗапроса);
				
							
			КонецЕсли;
			

			Если ТаблицаЗначений.Колонки.Найти("ДатаРождения") <> Неопределено Тогда
				
				датаРождения=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаРождения);
				
							
			КонецЕсли;
			

			Если ТаблицаЗначений.Колонки.Найти("НомерСудебногоДела") <> Неопределено Тогда
				
				НомерСудебногоДела=стр.НомерСудебногоДела;
				
							
			КонецЕсли;
			
			
			Если ТаблицаЗначений.Колонки.Найти("НомерИсполнительногоДокумента") <> Неопределено Тогда
				
				НомерИсполнительногоДокумента=стр.НомерИсполнительногоДокумента;
				
							
			КонецЕсли;
			
			
			
			Если ТаблицаЗначений.Колонки.Найти("Суд") <> Неопределено Тогда
				
				          судДанные= НайтиСуд(стр.Суд);
						  
						 Если судДанные.ссылкаСуд<>Неопределено Тогда
						 
						 	    Суд=судДанные.ссылкаСуд;
								судАдрес= судДанные.адресСуд;
						 
						 Иначе
						 
						 	    Суд=судДанные.ссылкаСуд;
								судАдрес= судДанные.адресСуд;

						 
						 КонецЕсли; 
						  
							
			КонецЕсли;

			
			 Если ТаблицаЗначений.Колонки.Найти("АдресСуда") <> Неопределено Тогда
				
				   судАдрес=судАдрес;
				
							
			КонецЕсли;
			

			
			Если ТаблицаЗначений.Колонки.Найти("ГиперссылкаСуд") <> Неопределено Тогда
				
				      ГиперссылкаСуд=стр.ГиперссылкаСуд;
				  
			КонецЕсли;
			
			
			Если ТаблицаЗначений.Колонки.Найти("СтатусИП") <> Неопределено Тогда
				
				СтатусИП=НайтиСтатусИП(стр.СтатусИП);
				
	                			
				  
			КонецЕсли;
			
			
			Если ТаблицаЗначений.Колонки.Найти("ДатаВозбужденияИП") <> Неопределено Тогда
				
				ДатаВозбужденияИП=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаВозбужденияИП);
				
							
			КонецЕсли;
			

			Если ТаблицаЗначений.Колонки.Найти("НомерИП") <> Неопределено Тогда
				
				      НомерИП=стр.НомерИП;
				  
			КонецЕсли;
			
			Если ТаблицаЗначений.Колонки.Найти("ДатаОкончанияИП") <> Неопределено Тогда
				
				ДатаОкончанияИП=СтроковыеФункцииКлиентСервер.СтрокаВДату(стр.ДатаОкончанияИП);
				
							
			КонецЕсли;

			
			Если ТаблицаЗначений.Колонки.Найти("НаименованиеОСП") <> Неопределено Тогда
				
				      НаименованиеОСПСтруктура=НайтиОСП(стр.НаименованиеОСП);
					  
					  Если НаименованиеОСПСтруктура.ссылкаОСП<>Неопределено Тогда
						  
						  НаименованиеОСПСсылка=НаименованиеОСПСтруктура.ссылкаОСП;
						  
						  НаименованиеОСП=НаименованиеОСПСтруктура.НазваниеОСП;
						  
						  АдресОСП=НаименованиеОСПСтруктура.АдресОСП;
					  	
					  
					  Иначе
					  
						  НаименованиеОСПСсылка=НаименованиеОСПСтруктура.ссылкаОСП;
						  
						  НаименованиеОСП=НаименованиеОСПСтруктура.НазваниеОСП;
						  
						  АдресОСП="";
					  	

						  
					  
					  КонецЕсли;   
					  
				  
			КонецЕсли;

			
			Если ТаблицаЗначений.Колонки.Найти("ГиперссылкаФССП") <> Неопределено Тогда
				
				      ГиперссылкаФССП=стр.ГиперссылкаФССП;
				  
			КонецЕсли;

			
			
			//   запишу в таблицу ТЗОбработа строку
			
			новаяСтрока= ТЗОбработа.Добавить();
			
			новаяСтрока.ДатаЗапроса= датаЗапроса;
			новаяСтрока.НомерСудебногоДела= НомерСудебногоДела;
			новаяСтрока.НомерИсполнительногоДокумента= НомерИсполнительногоДокумента;
			новаяСтрока.Суд= Суд;
			новаяСтрока.АдресСуда= судАдрес;
			новаяСтрока.Гиперссылка_суд= ГиперссылкаСуд;
			новаяСтрока.НомерДоговора= номерДоговора;
			новаяСтрока.Договор= ссылкаДоговор;
			новаяСтрока.ФИОДолжник= ссылкаДолжник;
			новаяСтрока.ДатаРождения= датаРождения;
			новаяСтрока.СтатусИП= СтатусИП;
			
			
			
			новаяСтрока.ДатаВозбужденияИП= ДатаВозбужденияИП;
			новаяСтрока.НомерИП= НомерИП;
			новаяСтрока.ДатаОкончанияИП= ДатаОкончанияИП;
			новаяСтрока.НаименованиеОСПСсылка= НаименованиеОСПСсылка;
			новаяСтрока.АдресОСП= АдресОСП;
			новаяСтрока.ГиперссылкаФССП= ГиперссылкаФССП;
			новаяСтрока.НаименованиеОСП= НаименованиеОСП;
			
			
			
			
			
			
			 
			
			
		КонецЦикла;
	   
	
	
	
КонецПроцедуры


&НаСервере
Функция НайтиОСП(стрОСП)

	 данныеОСП=Новый Структура;
	
	      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтделыОСП.Ссылка КАК Ссылка,
		|	ОтделыОСП.НазваниеОСП КАК НазваниеОСП,
		|	ОтделыОСП.АдресОСП КАК АдресОСП
		|ИЗ
		|	Справочник.ОтделыОСП КАК ОтделыОСП
		|ГДЕ
		|	ОтделыОСП.НазваниеОСП ПОДОБНО &НазваниеОСП";
	
	Запрос.УстановитьПараметр("НазваниеОСП","%"+ стрОСП+"%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	
		   Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		    данныеОСП.Вставить("ссылкаОСП",ВыборкаДетальныеЗаписи.Ссылка);
			
			данныеОСП.Вставить("НазваниеОСП",ВыборкаДетальныеЗаписи.НазваниеОСП);
			данныеОСП.Вставить("АдресОСП",ВыборкаДетальныеЗаписи.АдресОСП);
			
		
          КонецЦикла;

	
	Иначе
	
		    данныеОСП.Вставить("ссылкаОСП",Неопределено);
			
			данныеОСП.Вставить("НазваниеОСП","");
			данныеОСП.Вставить("АдресОСП","");
			

	
	КонецЕсли;
	
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	Возврат данныеОСП;
	
	
	

КонецФункции // ()





	
&НаСервере
Функция НайтиСтатусИП(стрСтатус)

	
	КолекцияПеречислений = Метаданные.Перечисления.СтатусИсполнительногоПроизводства;
    Для каждого пНайденноеЗначение из КолекцияПеречислений.ЗначенияПеречисления Цикл
        Если пНайденноеЗначение.Синоним = стрСтатус Тогда
            Возврат пНайденноеЗначение;
        КонецЕсли;
    КонецЦикла;
 	
   Возврат Неопределено;     	

КонецФункции // ()





&НаСервере
Функция  НайтиСуд(строкаСуд)

       данныеСуд=Новый Структура;
	   
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Суды.Ссылка КАК Ссылка,
		|	Суды.Адрес КАК Адрес
		|ИЗ
		|	Справочник.Суды КАК Суды
		|ГДЕ
		|	Суды.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование","%"+строкаСуд+"%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		данныеСуд.Вставить("ссылкаСуд",ВыборкаДетальныеЗаписи.Ссылка);
		данныеСуд.Вставить("адресСуд",ВыборкаДетальныеЗаписи.Адрес);
		
		
		
	    КонецЦикла;

		
	Иначе	
		
		данныеСуд.Вставить("ссылкаСуд",Неопределено);
		данныеСуд.Вставить("адресСуд","");
		
		
	КонецЕсли;
	
		
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	   
	
	
	
	Возврат данныеСуд;
	

КонецФункции // ()




&НаСервере
Функция НайтиДолжника(фиоДолжника,датаРожд)

	 ссылкаДолжник=Неопределено;
	 
	       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Должники КАК Должники
		|ГДЕ
		|	Должники.Наименование = &Наименование
		|	И Должники.ДатаРождения = &ДатаРождения";
	
	Запрос.УстановитьПараметр("ДатаРождения",СтроковыеФункцииКлиентСервер.СтрокаВДату(датаРожд));
	Запрос.УстановитьПараметр("Наименование", фиоДолжника);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ссылкаДолжник=ВыборкаДетальныеЗаписи.Ссылка
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	 Возврат ссылкаДолжник;
	

КонецФункции // ()



&НаСервере
Функция НайтиДоговор(номерДог,должник)

	
	        данныеДоговор=Новый Структура; 
	
	              	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Ссылка КАК Ссылка,
				|	Договоры.НомерДоговора КАК НомерДоговора
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.НомерДоговора = &НомерДоговора
				|	И Договоры.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("Владелец", должник);
			Запрос.УстановитьПараметр("НомерДоговора", номерДог);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
			
						      
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						// Вставить обработку выборки ВыборкаДетальныеЗаписи
					  данныеДоговор.Вставить("ссылкаДоговор",ВыборкаДетальныеЗаписи.Ссылка);
					  данныеДоговор.Вставить("НомерДоговора",ВыборкаДетальныеЗаписи.НомерДоговора);
					  
						
					КонецЦикла;

			
			Иначе
			          данныеДоговор.Вставить("ссылкаДоговор",Неопределено);
					  данныеДоговор.Вставить("НомерДоговора","");
					  
				
			
			КонецЕсли;
						
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	      Возврат данныеДоговор;
			

КонецФункции // ()



&НаСервере
Процедура ЗагрузитьНаСервере()

	  НачатьТранзакцию();
	
	 Попытка
	 
		  Для каждого стр Из ТЗОбработа Цикл
			  
			  
			 
			  
			  
						  
			  
			 ссылкаСправочник=ЕстьЛиТакоеДело(стр.НомерСудебногоДела,стр.Договор);
			 
			 Если ссылкаСправочник=Неопределено Тогда 
			     
			        новаяСтрока=Справочники.СостояниеДелБанкДолжник.СоздатьЭлемент();
			 
			    	 новаяСтрока.ДатаЗапроса=стр.ДатаЗапроса;
			    	 новаяСтрока.НомерСудебногоДела=стр.НомерСудебногоДела;
			    	 новаяСтрока.НомерИсполнительногоДокумента=стр.НомерИсполнительногоДокумента;
			    	 новаяСтрока.Суд=стр.Суд;
			    	 новаяСтрока.АдресСуда=стр.АдресСуда;
			    	 новаяСтрока.Гиперссылка_суд=стр.Гиперссылка_суд;
			    	 новаяСтрока.НомерДоговора=стр.НомерДоговора;
			    	 новаяСтрока.Договор=стр.Договор;
			    	 новаяСтрока.ФИОДолжник=стр.ФИОДолжник;
			    	 новаяСтрока.ДатаРождения=стр.ДатаРождения;
			    	 
			    	 новаяСтрока.СтатусИП=стр.СтатусИП;
			    	 
			    	 
			    	 новаяСтрока.ДатаВозбужденияИП=стр.ДатаВозбужденияИП;
			    	 новаяСтрока.НомерИП=стр.НомерИП;
			    	 новаяСтрока.ДатаОкончанияИП=стр.ДатаОкончанияИП;
			    	 новаяСтрока.НаименованиеОСП=стр.НаименованиеОСПСсылка;
			    	 новаяСтрока.АдресОСП=стр.АдресОСП;
			    	 новаяСтрока.ГиперссылкаФССП=стр.ГиперссылкаФССП;
					 
					 новаяСтрока.Исполнитель=сотрудникСеанс;
			    	  			  
			    	 
			    	 новаяСтрока.Записать();

			     
			     
			 Иначе
			     
			     об=ссылкаСправочник.ПолучитьОбъект();
			     
			      Если стр.ДатаЗапроса>об.ДатаЗапроса Тогда
			    	  
			    	 об.ДатаЗапроса=стр.ДатаЗапроса;
			    	 об.НомерСудебногоДела=стр.НомерСудебногоДела;
			    	 об.НомерИсполнительногоДокумента=стр.НомерИсполнительногоДокумента;
			    	 об.Суд=стр.Суд;
			    	 об.АдресСуда=стр.АдресСуда;
			    	 об.Гиперссылка_суд=стр.Гиперссылка_суд;
			    	 об.НомерДоговора=стр.НомерДоговора;
			    	 об.Договор=стр.Договор;
			    	 об.ФИОДолжник=стр.ФИОДолжник;
			    	 об.ДатаРождения=стр.ДатаРождения;
			    	 
			    	 об.СтатусИП=стр.СтатусИП;
					 
					 об.Исполнитель=сотрудникСеанс;
			    	 
			    	 об.ДатаВозбужденияИП=стр.ДатаВозбужденияИП;
			    	 об.НомерИП=стр.НомерИП;
			    	 об.ДатаОкончанияИП=стр.ДатаОкончанияИП;
			    	 об.НаименованиеОСП=стр.НаименованиеОСПСсылка;
			    	 об.АдресОСП=стр.АдресОСП;
			    	 об.ГиперссылкаФССП=стр.ГиперссылкаФССП;
			    	 
			    	   			  
			    	 
			    	 об.Записать();

			      	
			      
			      КонецЕсли; 
			     
			     
			     
			       
			    			
			     
			     
			 КонецЕсли;		 
			  
			  
			  
			  
		    		  
		  
	  
	      КонецЦикла;

		 
		 ЗафиксироватьТранзакцию();
	 
	 Исключение
		 
		 ОтменитьТранзакцию();
		 
		 
		 ТекстОшибки = ОписаниеОшибки();
		 
		 Сообщить(ТекстОшибки);
		 
		 
	 КонецПопытки;
	
	 	
	
	

КонецПроцедуры


&НаСервере
Функция ЕстьЛиТакоеДело(номерДела, договор)

	ссылкаСправочник=Неопределено;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеДелБанкДолжник.Ссылка КАК Ссылка,
		|	СостояниеДелБанкДолжник.НомерСудебногоДела КАК НомерСудебногоДела
		|ИЗ
		|	Справочник.СостояниеДелБанкДолжник КАК СостояниеДелБанкДолжник
		|ГДЕ
		|	СостояниеДелБанкДолжник.НомерСудебногоДела = &НомерСудебногоДела
		|	И СостояниеДелБанкДолжник.Договор.Ссылка = &Договор";
	
	Запрос.УстановитьПараметр("Договор", договор);
	Запрос.УстановитьПараметр("НомерСудебногоДела", номерДела);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ссылкаСправочник= ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


		

				
		Возврат ссылкаСправочник;		
				
				
	

КонецФункции // ()




&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
	
	   ЗагрузитьНаСервере();
	
	   
	   Сообщить("Ок");
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗОбработаСудОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	адресСуда= АдресСуда(ВыбранноеЗначение);

	Элемент.Родитель.ТекущиеДанные.АдресСуда= адресСуда;
	 
	
	
	
	 
	
	
КонецПроцедуры


&НаСервере
Функция АдресСуда(ссылкаСуд)

	
	об=ссылкаСуд.ПолучитьОбъект();
	
	
	
	Возврат об.Адрес;

КонецФункции // ()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	сотрудникСеанс=ПараметрыСеанса.Пользователь; 
	
	
	
	
КонецПроцедуры
